app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])

INSERT INTO "pages" ("created_at", "title", "body", "updated_at") VALUES('2010-07-17 12:35:46', 'Example Page', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Exceteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. ', '2010-07-17 12:35:46')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

INSERT INTO "documents" ("size", "created_at", "content_type", "title", "updated_at", "page_id", "parent_id", "filename", "attachable_type", "doc_title", "attachable_id") VALUES(26112, '2010-08-03 19:47:06', 'application/msword', NULL, '2010-08-03 19:47:06', NULL, NULL, 'Blargablargablargblarg.doc', NULL, 'New Document', NULL)
SELECT * FROM "pages" WHERE ("pages"."id" = -614037148) LIMIT 1
UPDATE "documents" SET "attachable_id" = 1, "updated_at" = '2010-08-03 04:30:40', "attachable_type" = 'Page' WHERE "id" = 3
---
  def upload_document

    @document = Document.create!(params[:document])
      @page = Page.find_by_id($page_id)
        @document.attachable_type = 'Page'
        @document.attachable_id = @page.id
debugger
    if @document.save

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def update
    @page = Page.find(params[:id])